OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/simple_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          800;
        startFace       186400;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       187200;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       188000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       189600;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       191200;
    }
)

// ************************************************************************* //
