OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/simple_test/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue penalty 0
    volScalarFieldValue alpha 0
);

regions
(
    boxToCell
    {
        box          (0 -1 -1)(1 0 1);
        fieldValues
        (
            volScalarFieldValue penalty 1
            volScalarFieldValue alpha   50000
        );
    }
);


// ************************************************************************* //
